---
kind: method
id: M:Autodesk.Revit.DB.ConnectorSet.Contains(Autodesk.Revit.DB.Connector)
source: html/099084eb-a6f9-b385-736a-90559ebe84ca.htm
---
# Autodesk.Revit.DB.ConnectorSet.Contains Method

## Syntax (C#)
```csharp
public virtual bool Contains(
	Connector item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Connector`)